# Install with: brew bundle --global
brew "ack"
brew "bat"
brew "coreutils"
brew "cowsay"
brew "ctags"
brew "curl"
brew "entr"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "gawk"
brew "grep"
brew "imagemagick"
brew "markdown"
brew "redis"
brew "shellcheck"
brew "sqlite"
brew "tmux"
brew "tree"
brew "unzip"
brew "vcprompt"
brew "vim"
brew "watch"
brew "wget"
brew "automake"
brew "autoconf"
brew "openssl"
brew "libyaml"
brew "readline"
brew "libxslt"
brew "libtool"
brew "unixodbc"
brew "ripgrep"
brew "fzf"
brew "gh"
brew "mise"
brew "overmind"
brew "lnav"
brew "jq"
brew "fd"
brew "procs"
cask "gcloud-cli"
