# Install with: brew bundle --global
tap "kristoferlund/ostt"
tap "supabase/tap"
tap "homeport/tap"

cask "gcloud-cli"
cask "bruno"
cask "font-hack-nerd-font"
cask "soulver-cli"

brew "ack"
brew "bat"
brew "bats"
brew "coreutils"
brew "cowsay"
brew "ctags"
brew "curl"
brew "entr"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "gawk"
brew "grep"
brew "imagemagick"
brew "markdown"
brew "mise" # runtime version manager — script/bootstrap runs `mise install` after brew bundle
brew "redis"
brew "shellcheck"
brew "sqlite"
brew "terminal-notifier" # clickable macOS notifications — agent-board-hook uses it for blocked-session alerts
brew "tmux"
brew "tree"
brew "unzip"
brew "vcprompt"
brew "vim"
brew "watch"
brew "wget"
brew "automake"
brew "autoconf"
brew "openssl"
brew "libyaml"
brew "readline"
brew "libxslt"
brew "libtool"
brew "unixodbc"
brew "ripgrep"
brew "fzf"
brew "gh"
brew "just"
brew "overmind"
brew "lnav"
brew "jq"
brew "fd"
brew "procs"
brew "watchexec"
brew "git-lfs"
brew "git-trim" # delete local branches whose upstream is merged or gone (git trim)
brew "ffmpeg"
brew "kristoferlund/ostt/ostt"
brew "supabase"
brew "with-readline"
brew "termshot"
brew "gum"
brew "mcp-toolbox" # Google MCP Toolbox for Databases — read-only DB access for agents
